/**
  ********************************  STM32F0xx  *********************************
  ******************************************************************************/
/*----------------------------------------------------------------------------
  ----------------------------------------------------------------------------*/
//prer:分频数:0~7(只有低 3 位有效!)
//分频因子=4*2^prer.但最大值只能是 256!
//rlr:重装载寄存器值:低 11 位有效.
//时间计算(大概):Tout=((4*2^prer)*rlr)/40 (ms)
/* 包含的头文件 --------------------------------------------------------------*/

#include "IWDG.h"
/************************************************
函数名称 ： WDG_Config
功    能 ： 看门狗配置
参    数 ： 无
返 回 值 ： 无
*************************************************/
void WDG_Config(void)
{
	if(RCC_GetFlagStatus(RCC_FLAG_IWDGRST) != RESET)
	{
		RCC_ClearFlag();					//清除标志
	}
	IWDG_WriteAccessCmd(IWDG_WriteAccess_Enable);  //允许访问IWDG_PR和IWDG_RLR寄存器
	IWDG_SetPrescaler(IWDG_Prescaler_32);	//分频值40000/32=1250

	IWDG_SetReload(40*FeedDogTime/32);	//重载值(在3秒内必须喂狗，否则会复位)
	IWDG_ReloadCounter();					//使能重载值
	IWDG_Enable();                                 	//使能看门狗
}

void Feed_Dog(void)
{
	IWDG_ReloadCounter();					//喂狗
}


